; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v5 - type_3 ?v1 - type_2)
 	      (pred_1 ?v8 - object ?v1 - type_2)
	      (pred_2 ?v5 - type_3 ?v6 - type_1)
	      (pred_3 ?v5 - type_3 ?v8 - object ?v6 - type_1))

   (:action op_3
       :parameters  (?v5 - type_3 ?v7 ?v3 - type_2)
       :precondition (and  (pred_4 ?v5 ?v7))
       :effect (and  (pred_4 ?v5 ?v3)
		     (not (pred_4 ?v5 ?v7))))

   (:action op_2
       :parameters (?v5 - type_3 ?v2 - object ?v4 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v2 ?v4) (pred_4 ?v5 ?v4) (pred_2 ?v5 ?v6))
       :effect (and (pred_3 ?v5 ?v2 ?v6)
		    (not (pred_1 ?v2 ?v4)) 
		    (not (pred_2 ?v5 ?v6))))

   (:action op_1
       :parameters (?v5 - type_3 ?v2 - object ?v4 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_3 ?v5 ?v2 ?v6) (pred_4 ?v5 ?v4))
       :effect (and (pred_1 ?v2 ?v4)
		    (pred_2 ?v5 ?v6)
		    (not (pred_3 ?v5 ?v2 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_07 - type_3
obj_08 obj_01 - type_1
obj_04 obj_05 obj_10 obj_02 - type_2
obj_03 obj_09 obj_06 - object)
(:init
(pred_4 obj_07 obj_10)
(pred_2 obj_07 obj_08)
(pred_2 obj_07 obj_01)
(pred_1 obj_03 obj_04)
(pred_1 obj_09 obj_04)
(pred_1 obj_06 obj_02)
)
(:goal
(and
(pred_1 obj_03 obj_04)
(pred_1 obj_09 obj_05)
(pred_1 obj_06 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_07 ?b obj_01))))
)
)

; plan
1. (op_3 obj_07 obj_10 obj_04)
   deleted: (pred_4 obj_07 obj_10)
   added: (pred_4 obj_07 obj_04)
   goals met: 2 of 3
2. (op_2 obj_07 obj_09 obj_04 obj_08)
   deleted: (pred_1 obj_09 obj_04) (pred_2 obj_07 obj_08)
   added: (pred_3 obj_07 obj_09 obj_08)
   goals met: 2 of 3
3. (op_3 obj_07 obj_04 obj_05)
   deleted: (pred_4 obj_07 obj_04)
   added: (pred_4 obj_07 obj_05)
   goals met: 2 of 3
4. (op_1 obj_07 obj_09 obj_05 obj_08)
   deleted: (pred_3 obj_07 obj_09 obj_08)
   added: (pred_1 obj_09 obj_05) (pred_2 obj_07 obj_08)
   goals met: 3 of 3
